# Curve Overlap Point Second Parameter Property

Source: https://www.revitapidocs.com/2026/72f17893-6774-fb58-a4df-70a507a96fdf.htm

---

| Curve Overlap Point Second Parameter Property |
| --- |

The point's unnormalized parameter on the second curve.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double SecondParameter { get; }
```

```
Public ReadOnly Property SecondParameter As Double
	Get
```

```
public:
property double SecondParameter {
	double get ();
}
```

```
member SecondParameter : float with get
```

#### Property Value

Double See Also

#### Reference

CurveOverlapPoint Class Autodesk.Revit.DB Namespace